# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet..::..Contains Method
TemperatureRatingTypeSet Class See Also
---
Tests for the existence of a TemperatureRating type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	TemperatureRatingType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As TemperatureRatingType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	TemperatureRatingType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeThe TemperatureRating type to be searched for.
# ### Return Value
The Contains method returns True if the TemperatureRating type is within the set, otherwise False.
# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace